-- -------------------------------------------------------------
-- TablePlus 6.0.0(550)
--
-- https://tableplus.com/
--
-- Database: jake-klchb
-- Generation Time: 2026-04-20 00:05:13.3390
-- -------------------------------------------------------------


DROP TABLE IF EXISTS "public"."vaccines";
-- This script only contains the table creation statements and does not fully represent the table in the database. Do not use it as a backup.

-- Sequence and defined type
CREATE SEQUENCE IF NOT EXISTS vaccines_id_seq;

-- Table Definition
CREATE TABLE "public"."vaccines" (
    "id" int4 NOT NULL DEFAULT nextval('vaccines_id_seq'::regclass),
    "uuid" uuid NOT NULL,
    "name" text NOT NULL,
    "months" int4 NOT NULL,
    "created_at" timestamp(3) NOT NULL DEFAULT CURRENT_TIMESTAMP,
    "updated_at" timestamp(3) NOT NULL DEFAULT CURRENT_TIMESTAMP,
    PRIMARY KEY ("id")
);

-- Indices
CREATE UNIQUE INDEX vaccines_uuid_key ON public.vaccines USING btree (uuid);

INSERT INTO "public"."vaccines" ("id", "uuid", "name", "months", "created_at", "updated_at") VALUES
(1, '59d48e49-88a7-48b6-82fd-070c011ca427', 'B 型肝炎疫苗第二劑 ', 1, '2025-04-13 07:51:27.912', '2025-04-13 07:51:27.912'),
(2, '15cc9589-7141-46c1-abc3-ed0502e1546b', 'B 型肝炎疫苗第三劑 ', 6, '2025-04-13 07:54:41.931', '2025-04-13 07:54:41.931'),
(3, '04575395-34b3-4184-bd48-ea73d82a949f', '卡介苗', 5, '2025-04-13 07:55:20.377', '2025-04-13 07:55:20.377'),
(4, 'c6f48f7a-fa8d-49fa-8824-c49d6852447d', '白喉破傷風非細胞性百日咳、b 型嗜血桿菌及不活化小兒麻痺五合一疫苗第一劑', 2, '2025-04-13 07:56:27.391', '2025-04-13 07:56:27.391'),
(5, 'e142bfaf-3701-4e51-8066-f5c2ac1a7fe4', '白喉破傷風非細胞性百日咳、b 型嗜血桿菌及不活化小兒麻痺五合一疫苗第二劑', 4, '2025-04-13 07:57:31.999', '2025-04-13 07:57:31.999'),
(6, '0dcf2952-3269-459d-b013-984b49afda50', '白喉破傷風非細胞性百日咳、b 型嗜血桿菌及不活化小兒麻痺五合一疫苗第三劑', 6, '2025-04-13 07:57:31.999', '2025-04-13 07:57:31.999'),
(7, '7fa20efb-0b35-495d-a9a2-a9c3f5ed91c5', '白喉破傷風非細胞性百日咳、b 型嗜血桿菌及不活化小兒麻痺五合一疫苗第四劑', 18, '2025-04-13 07:57:31.999', '2025-04-13 07:57:31.999'),
(8, '7781717f-b5db-4e4b-8792-01926607c1b1', '13價結合型肺炎鏈球菌疫苗第一劑', 2, '2025-04-13 07:58:41.391', '2025-04-13 07:58:41.391'),
(9, '33984515-a591-4db3-ad46-2da86b1edd4e', '13價結合型肺炎鏈球菌疫苗第二劑', 4, '2025-04-13 07:58:41.391', '2025-04-13 07:58:41.391'),
(10, 'b5af359b-2930-4209-8901-d4e01bc1b1e3', '13價結合型肺炎鏈球菌疫苗第三劑', 12, '2025-04-13 07:58:41.391', '2025-04-13 07:58:41.391'),
(11, '947e600d-9baf-46f0-ad9d-60d092e4e1b8', '水痘疫苗', 12, '2025-04-13 07:59:11.7', '2025-04-13 07:59:11.7'),
(12, '849107e2-fe27-4e10-9a47-eefd543ae023', '麻疹腮腺炎德國麻疹混合疫苗第一劑', 12, '2025-04-13 08:02:38.294', '2025-04-13 08:02:38.294'),
(13, 'eeec71fe-3c96-410b-90ca-ad2a2f36bd30', '麻疹腮腺炎德國麻疹混合疫苗第二劑', 60, '2025-04-13 08:02:38.294', '2025-04-13 08:02:38.294'),
(14, 'bb609e19-385a-41ac-9090-561d5601ca72', '活性減毒嵌合型日本腦炎疫苗第一劑', 15, '2025-04-13 08:03:30.291', '2025-04-13 08:03:30.291'),
(15, '53d9cd93-4164-4bc0-a473-d61fb6ed9f98', '活性減毒嵌合型日本腦炎疫苗第二劑', 27, '2025-04-13 08:03:30.291', '2025-04-13 08:03:30.291'),
(16, '85ad0a2f-e3fb-4499-9eaa-2454e647598b', 'A 型肝炎疫苗第一劑', 18, '2025-04-13 08:06:15.468', '2025-04-13 08:06:15.468'),
(17, '044b53f8-a978-4178-9b87-e75f4a67d17d', 'A 型肝炎疫苗第二劑', 27, '2025-04-13 08:06:15.468', '2025-04-13 08:06:15.468'),
(18, 'c099db09-2580-4289-8ee1-65baddcb1c0e', '白喉破傷風非細胞性百日咳及不活化小兒麻痺混合疫苗', 60, '2025-04-13 08:06:50.077', '2025-04-13 08:06:50.077');
